In my case,

```
Terraform v1.2.5
on darwin_amd64
+ provider registry.terraform.io/hashicorp/aws v4.11.0
+ provider registry.terraform.io/hashicorp/template v2.2.0
```

From plan:

```
  # module.cloudwatch.aws_cloudwatch_metric_alarm.high-cpuload-mgmt will be destroyed
  # (because aws_cloudwatch_metric_alarm.high-cpuload-mgmt is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "high-cpuload-mgmt" {
      - actions_enabled           = true -> null
      - alarm_actions             = [] -> null
      - alarm_description         = "The orderer instance has high CPU utilization" -> null
      - alarm_name                = "High mgmt CPU utilization" -> null
      - arn                       = "arn:aws:cloudwatch:us-west-2:648042526096:alarm:High mgmt CPU utilization" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 4 -> null
      - dimensions                = {
          - "InstanceId" = "i-0ed1041ee5f20f04e"
        } -> null
      - evaluation_periods        = 5 -> null
      - id                        = "High mgmt CPU utilization" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "CPUUtilization" -> null
      - namespace                 = "AWS/EC2" -> null
      - ok_actions                = [] -> null
      - period                    = 120 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 80 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.cloudwatch.aws_cloudwatch_metric_alarm.high_cpuload-mgmt will be created
  + resource "aws_cloudwatch_metric_alarm" "high_cpuload-mgmt" {
      + actions_enabled                       = true
      + alarm_description                     = "The orderer instance has high CPU utilization"
      + alarm_name                            = "High mgmt CPU utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 4
      + dimensions                            = {
          + "InstanceId" = "i-0ed1041ee5f20f04e"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 120
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }
```

From apply:

```
│ Error: Provider produced inconsistent result after apply
│
│ When applying changes to module.cloudwatch.aws_cloudwatch_metric_alarm.high_cpuload-mgmt, provider "provider[\"registry.terraform.io/hashicorp/aws\"]" produced an unexpected new value: Root resource was present, but now absent.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
```